app/controllers/posts_controller.rb

  def index
    if params[:title].nil?
      @posts = Post.all
---
SELECT "posts".* FROM "posts" WHERE (title like 'title%')

  def create
    @post = Post.new(params[:post].permit(:title, :text))
    if @post.save
---
INSERT INTO "posts" ("created_at", "text", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Fri, 28 Feb 2014 18:47:34 UTC +00:00], ["text", "text4"], ["title", "title4"], ["updated_at", Fri, 28 Feb 2014 18:47:34 UTC +00:00], ["user_id", 1]]

  def show
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."id" ASC LIMIT 1  [["id", 1]]

  def update
    @post = Post.find(params[:id])

    if @post.update(params[:post].permit(:title, :text))
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = 2  [["title", "title2"], ["updated_at", Wed, 26 Feb 2014 14:15:50 UTC +00:00]]